const booksCards = document.querySelector('#books-cards');
const totalExpenses = document.querySelector('.total-expenses');
const searchBar = document.querySelector('#search-bar');
const searchBtn = document.querySelector('#search-btn');
const clearBtn = document.querySelector('#clear-btn');
const sortExpensive = document.querySelector('#sort-expensive');
const sortCheap = document.querySelector('#sort-cheap');
const countBtn = document.querySelector('#count-btn');

const books = [
    {
        title: "Хірург - Тесс Геррітсен",
        price: 270,
        imgSrc: "img/surgeon.jpg",
        description: `"Судовий антрополог Девід Гантер утратив дружину і дочку. <br>
                    Покинувши роботу, він переїздить до містечка Менем та влаштовується на <br>
                    посаду терапевта. Ніхто з нових знайомих і гадки не має про минуле Девіда. <br>
                    Здається, його життя потихеньку повертається у спокійне русло. <br>
                    Поки місцеві хлопці не знаходять на болоті тіло вбитої жінки. <br>
                    Згодом зникає ще одна жінка, а за кілька днів знаходять і її понівечене тіло. <br>
                    Схоже, в Менемі з’явився серійний убивця. У містечку наростає тривога. <br>
                    Мешканці підозрюють одне одного у скоєному. Девід не може стояти осторонь та <br>
                    втягується в розслідування. До того ж остання зникла - нова знайома Девіда."`
    },
    {
        title: "Нотатки ненависті - Ві Кіланд, Пенелопа Уорд",
        price: 300,
        imgSrc: "img/notatku-nenavuski.jpg",
        description: `"Шарлотта завжди мріяла про мить, коли вбереться у весільну сукню, <br>
                    але аж ніяк не про день, коли її доведеться продавати, так і не одягнувши…
                    <br>
                    Дівчина відносить вбрання у вінтажний магазин, де у підкладці плаття <br>
                    іншої нареченої випадково знаходить записку на блакитному клаптику.<br>
                    «Дякую тобі за те, що здійснила всі мої мрії. Твій коханий, Рід». <br>
                    Здається, це наймиліше, що Шарлотта будь-коли бачила,
                    <br>а цей чоловік, імовірно, найромантичніша людина на світі…
                    <br>
                    За іронією долі Рід Іствуд виявляється новим босом дівчини <br>
                    і відкривається їй з дещо іншого боку: він цинічний та зарозумілий. <br>
                    Попри це, Шарлотті не виходить з голови любовна записка, знайдена в сукні, <br>
                    тож їй кортить дізнатися про минуле Ріда."`,
    },
    {
        title: "Хімія смерті - Саймон Бекетт",
        price: 270,
        imgSrc: "img/ximia-smerti.jpg",
        description: `"Судовий антрополог Девід Гантер утратив дружину і дочку. <br>
                    Покинувши роботу, він переїздить до містечка Менем та влаштовується на <br>
                    посаду терапевта. Ніхто з нових знайомих і гадки не має про минуле Девіда. <br>
                    Здається, його життя потихеньку повертається у спокійне русло. <br>
                    Поки місцеві хлопці не знаходять на болоті тіло вбитої жінки. <br>
                    Згодом зникає ще одна жінка, а за кілька днів знаходять і її понівечене тіло. <br>
                    Схоже, в Менемі з’явився серійний убивця. У містечку наростає тривога. <br>
                    Мешканці підозрюють одне одного у скоєному. Девід не може стояти осторонь та <br>
                    втягується в розслідування. До того ж остання зникла - нова знайома Девіда."`,
    },
    {
        title: "Випадкові наречені - Крістіна Лорен",
        price: 300,
        imgSrc: "img/vupadkovi-narecheni.jpg",
        description: `"Сестри-близнючки Олів та Емілія мають геть різну вдачу.<br> 
                    В Олів ніколи ні з чим не складалося — ані в кар’єрі, ані в коханні. <br>
                    Якось шестирічна дівчинка застрягла в автоматі з іграшками, і про це писали всі місцеві видання. <br>
                    А ось Емілія — щасливиця.Навіть весілля з коханим красенем вона<br> 
                    зуміла оплатити завдяки виграшам в інтернет-конкурсах. <br>
                    Утім, під час весілля щось пішло не так: усі гості разом із молодятами отруїлися. <br>
                    Пригода оминула тільки Олів та Ітана, дружку нареченого,<br>
                     який страшенно не сподобався невдачливій сестрі. <br>
                    Та хіба варто через таке марнувати оплачений медовий місяць на Гаваях? <br>
                    Замість молодят у мандрівку вирушають Олів з Ітаном.<br>
                     Чи вдасться їм забути про взаємну неприязнь і добряче відпочити?"`,
    },
    {
        title: "Я бачу, вас цікавить пітьма - Ілларіон Павлюк",
        price: 580,
        imgSrc: "img/ya-bachy-vas.jpg",
        description: `"Київського кримінального психолога Андрія Гайстера відправляють консультантом <br>
                    у богом забуте селище Буськів Сад. Зимової ночі там зникла маленька дівчинка. <br>
                    А ще там водиться Звір — серійний маніяк, убивств якого тамтешні мешканці воліють не помічати... <br>
                    У цьому проклятому селищі, де все по колу і всі живуть життям, <br>
                    яке ненавидять, розслідування постійно заходить у глухий кут. <br>
                    Андрій вірить, що загублена дівчинка, попри все, жива і він її знайде. <br>
                    Але нікому, крім нього, це не потрібно.
                    <br>
                    «Я бачу, вас цікавить пітьма» — історія про непробивну людську байдужість<br>
                    і пітьму всередині нас. Про чесність із собою й ціну, яку ми готові заплатити за забуття.<br>
                    Про гріхи, що матеріалізуються, і спокуту, дорожчу за спокій."`,
    },
    {
        title: "Усе, що з нами навіки - Люсі Скор",
        price: 450,
        imgSrc: "img/yse-sho-z-namu-na-viku.jpg",
        description: `"Вона втекла зі свого весілля, щоб нарешті знайти справжнє кохання<br>
                    <br>
                    Наомі тікає зі свого весілля до сестри-близнючки Тіни<br> 
                    (яка ніколи не відзначалась хорошою поведінкою) до містечка Нокемаут у штаті Вірджинія. <br>
                    Суперечки там вирішують старомодним способом: кулаками й пивом. <br>
                    Та майже відразу з’ясовується, що сестра ані краплі не змінилася: <br>
                    Тіна забирає гроші й машину Наомі, а натомість залишає її зі своєю донькою. <br>
                    І тепер Наомі застрягла тут з одинадцятирічною племінницею, без машини, <br>
                    роботи, дому, будь-якого плану та змоги покинути це місто.
                    <br>
                    Та на шляху їй трапляється Нокс. Цей бородатий перукар не терпить драми й романтики. <br>
                    Найкраще йому живеться на самоті, і ніяких стосунків він не потребує. <br>
                    Проте його світогляд змінює Наомі, чиє життя руйнується на його очах."`,
    },
    {
        title: "9 листопада - Колін Гувер",
        price: 405,
        imgSrc: "img/9-november.jpg",
        description: `"Як знати, що кохання справжнє? А який він — любовний поцілунок як у книжках?<br>
                    Як вісімнадцятирічним зрозуміти, що ця хімія гормонів переросте в щире кохання на все життя?<br>
                    І чи можна пробачити тому, хто збрехав ще в день знайомства?<br>
                    Ось на ці запитання шукають відповіді Феллон і Бен, які зустрічаються раз на рік упродовж п’яти років.<br>
                    А вам цікаво дізнатися, як закоханість юних героїв роману переростає в кохання?<br> 
                    Як, долаючи перепони, зізнаючись у найпотаємнішому і спокутуючи провини,<br>
                    Феллон і Бенові вдається пробачити собі та повірити в себе, не втративши одне одного?"`,
    },
    {
        title: "Незриме життя Адді Лярю - Вікторія Шваб",
        price: 495,
        imgSrc: "img/addi-lyary.jpg",
        description: `"Далекого 1714 року у Франції одна дівчина укладає фаустівську угоду, щоб отримати вічне життя. <br>
                    Але угода виявляється прокляттям: тепер її забуватимуть усі, кого вона зустріне на своєму шляху.<br>
                    <br>
                    Так починається неймовірне життя Адді Лярю, її приголомшлива подорож століттями<br> 
                    і континентами, історією і мистецтвом, під час якої вона шукає способу залишити слід у світі. <br>
                    Проте одного дня, триста років по тому, все змінюється,<br>
                    коли Адді в одній непримітній книгарні натрапляє на юнака, який пам’ятає її ім’я."`,
    },
    {
        title: "Краще, ніж у фільмах - Лінн Пейнтер",
        price: 390,
        imgSrc: "img/better-then-in-films.jpg",
        description: `"Ліз Баксбаум завжди знала, що Вес Беннет — жахливий сусід.<br>
                    У нього наче шило в одному місці ще з дитинства: то підкладе жабу в її «Будиночок мрії Барбі»,<br>
                    то відітне голову садовому гномові й залишить у саморобній дівчачій бібліотеці. <br>
                    Минуло вже десять років після обезголовлення гнома і, здавалося б, усе мало змінитись… <br>
                    Але тепер у сусідів нова жорстока війна: за паркувальне місце на їхній вулиці.<br>
                    Це останній рік шкільного навчання для Ліз — час, сповнений важливих подій, які вартують великого екрана.<br>
                     Адже дівчина просто поглинута фантазіями про те, що її життя складеться так, як у романтичних стрічках. <br>
                     Зненацька виявляється, що їй потрібна Весова допомога. <br>
                     Річ у тім, що Ліз дуже давно закохана в Майкла — хлопця її мрії, який щойно повернувся до міста і,<br>
                     хоч як це прикро, заприятелював із Весом. Якщо Ліз хоче, щоб Майкл нарешті звернув на неї увагу,<br>
                    то нестерпний сусід Вес — її шанс.<br>
                    Але потрібне диво, щоб дівчині вдалося вмовити Веса піти на дивакувату угоду,<br>
                    метою якої стане влаштування для Ліз чарівного, майже кіношного романтичного моменту, <br>
                    в якому вона буде разом із Майклом на їхньому випускному… <br>
                    А може, Вес насправді вже не той огидний капосник, а дорослий і надійний хлопець, з яким можна мати справу?"`,
    },
    {
        title: "Панк 57 - Пенелопа Дуглас",
        price: 320,
        imgSrc: "img/pank57.jpg",
        description: `"Ми були ідеальною парою. Поки не зустрілися<br>
                    <br>
                    У п’ятому класі вчителі випадково поставили Мішу і Раєн у пару для листування. <br>
                    Їх розділяли десятки кілометрів, але об’єднували спільні думки і захоплення. <br>
                    Тільки одне з одним вони могли бути по-справжньому відвертими та щирими. <br>
                    Ці листи тримали їх на плаву в найтяжчі моменти дорослішання. <br>
                    Довгі сім років у їхньої дружби було лише три правила: не шукати одне одного в соцмережах,<br>
                    жодних телефонних дзвінків, жодних фотографій.<br>
                    <br>
                    Проте одного дня Міша вирішив порушити домовленість і побачити Раєн... <br>
                    Це була ненависть із першого погляду! Але Раєн навіть не здогадувалася, що перед нею Міша, її Міша. <br>
                    Дівчина не розуміє, чому більше не отримує листів від нього, чому він зник з її життя. <br>
                    Однак вона готова на все, аби повернути друга!"`,
    }
];

let originalOrder = [];

function displayBooks() {
    const booksContainer = document.getElementById('books-cards');
    booksContainer.innerHTML = ''; 

    books.forEach((book, index) => {
        const bookCard = document.createElement('div');
        bookCard.classList.add('book-card');  // add css
        bookCard.setAttribute('data-price', book.price);
        bookCard.setAttribute('data-index', index + 1);

        bookCard.innerHTML = `
            <h3 class="book-title">${book.title}</h3>
            <img src="${book.imgSrc}" alt="book-${index + 1}" class="book">
            <p>${book.description}</p>
            <h4>Price: ${book.price} грн</h4>
            <div class="actions">
                <button class="add-btn">Додати</button>
                <button class="like-btn">Вподобати</button>
            </div>
        `;
        booksContainer.appendChild(bookCard);
    });

    originalOrder = Array.from(booksContainer.children);
}

document.addEventListener('DOMContentLoaded', () => {
    displayBooks();
});

sortExpensive.addEventListener('change', () => {
    if (sortExpensive.checked) {
        const booksArray = Array.from(booksCards.children).filter(book => book.style.display !== 'none');
        const sortedBooks = booksArray.sort((a, b) => {
            const priceA = parseFloat(a.getAttribute('data-price'));
            const priceB = parseFloat(b.getAttribute('data-price'));
            return priceB - priceA; 
        });
        booksCards.innerHTML = '';
        sortedBooks.forEach(book => booksCards.appendChild(book));
        sortCheap.checked = false; 
    }
});

sortCheap.addEventListener('change', () => {
    if (sortCheap.checked) {
        const booksArray = Array.from(booksCards.children).filter(book => book.style.display !== 'none');
        const sortedBooks = booksArray.sort((a, b) => {
            const priceA = parseFloat(a.getAttribute('data-price'));
            const priceB = parseFloat(b.getAttribute('data-price'));
            return priceA - priceB; 
        });
        booksCards.innerHTML = '';
        sortedBooks.forEach(book => booksCards.appendChild(book));
        sortExpensive.checked = false; 
    }
});

searchBtn.addEventListener('click', () => {
    const query = searchBar.value.trim().toLowerCase();
    const books = booksCards.children;
    Array.from(books).forEach(book => {
        const title = book.querySelector('.book-title').textContent.toLowerCase();
        if (title.includes(query)) {
            book.style.display = '';
        } else {
            book.style.display = 'none';
        }
    });
});

clearBtn.addEventListener('click', () => {
    searchBar.value = ''; 

    booksCards.innerHTML = '';
    originalOrder.forEach(book => booksCards.appendChild(book));

    Array.from(booksCards.children).forEach(book => {
        book.style.display = ''; 
    });

    sortExpensive.checked = false; 
    sortCheap.checked = false;

    totalExpenses.textContent = '0';
});

countBtn.addEventListener('click', () => {
    let totalPrice = 0;
    Array.from(booksCards.children).forEach(book => {
        if (book.style.display !== 'none') {
            totalPrice += parseFloat(book.getAttribute('data-price'));
        }
    });
    totalExpenses.textContent = totalPrice.toFixed(2);
});