import React from "react";
import "./Main.css";

const Main = () => {
  return (
    <main className="main-content">
      <section className="hero">
        <div className="hero-container">
          <div className="hero-image">
            <img src="/library.jpg" alt="Бібліотека" /> 
          </div>
          <div className="hero-text">
            <h2>Книгарня-кав’ярня Старого Лева</h2>
            <p>
              Книгарня-кав’ярня Старого Лева – це чарівне місце, де можна насолодитися витонченим смаком кави та зануритися у світ книжок.<br></br>
              Цей заклад – ідеальне місце для тих, хто любить проводити свій час з користю та задоволенням.<br></br>
              Ми не просто книгарня та кав'ярня, але й пункт інтересу, де можна зустріти цікавих людей, обговорити книжки та поділитися своїми враженнями.<br></br>
              Завітайте до книгарні-кав’ярні Старого Лева та відчуйте неперевершеність поєднання книжкового та кавового світу у всій його красі.<br></br>
              Ми чекаємо на вас!
            </p>
          </div>
        </div>
      </section>
    </main>
  );
};

export default Main;
