import React from "react";
import "./Grid.css";

const books = [
  {
    id: 1,
    title: "7 чоловіків Евілін Г'юго",
    imgSrc: "/7-mans-evelin-gugo.jpg",
    description: `Уже літня та замкнута в собі голлівудська ікона кіно Евелін Хьюго нарешті готова розповісти правду про своє гламурне та скандальне життя. Але коли вона обирає на цю роботу невідому журналістку Монік Грант, дивуються всі. Незалежно від того, чому Евелін вибрала її для написання своєї біографії, Монік рішуче використовує цю можливість, аби розпочати свою кар’єру. Вона захоплено слухає, як акторка розповідає свою історію про сімох чоловіків, нещадні амбіції, темні сторони старого Голлівуду та велике заборонене кохання. Монік починає відчувати цілком реальний зв’язок із легендарною зіркою, але коли історія Евелін наближається до свого завершення, стає зрозуміло, що їхнє життя перетинається трагічними та незворотними шляхами.`
  },
  {
    id: 2,
    title: "9 листопада",
    imgSrc: "/9-november.png",
    description: `Як знати, що кохання справжнє? А який він — любовний поцілунок як у книжках? Як вісімнадцятирічним зрозуміти, що ця хімія гормонів переросте в щире кохання на все життя? І чи можна пробачити тому, хто збрехав ще в день знайомства? Ось на ці запитання шукають відповіді Феллон і Бен, які зустрічаються раз на рік упродовж п’яти років. А вам цікаво дізнатися, як закоханість юних героїв роману переростає в кохання? Як, долаючи перепони, зізнаючись у найпотаємнішому і спокутуючи провини, Феллон і Бенові вдається пробачити собі та повірити в себе, не втративши одне одного?`
  },
  {
    id: 3,
    title: "Так тобі й треба, або Чому в стосунках варто обирати себе",
    imgSrc: "/tak-tobi-i-treba.webp",
    description: `«Не хочу рівно, хочу, як у кіно». Від першої закоханості й метеликів у животі до конфліктів та важких рішень. У своїй книжці блогерка й авторка бестселера «Матера вам не наймичка» Катя Бльостка відверто ділиться власною історією, починаючи від посиденьок з подружкою на дискотеці та перших побачень і до сварок із чоловіком й усвідомлення власних потреб. Ця історія про любов, секс і стосунки з чоловіками, вона про зростання у невеликому селищі та дорослішання. А ще ця історія про вибір та любов до себе як основу всіх стосунків. Від дівчинки-підлітки до дорослої жінки — авторка ділиться своїми поглядами з гумором, самоіронією та легкою дозою вишуканого матюччя.`
  }
];

const Grid = () => {
  return (
    <section className="tiles">
      {books.map((book) => (
        <div className="tile" key={book.id}>
          <div className="tile-image">
            <img src={book.imgSrc} alt={book.title} />
          </div>
          <h2>{book.title}</h2>
          <p>{book.description}</p>
        </div>
      ))}
    </section>
  );
};

export default Grid;
